# ElementTransformUtils Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementTransformUtils Class
Members See Also
---
A collection of utilities allowing transformation of elements (e.g. move, rotate, mirror and copy).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static class ElementTransformUtils
```

Visual Basic
---
```text
Public NotInheritable Class ElementTransformUtils
```

Visual C++
---
```text
public ref class ElementTransformUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ElementTransformUtils
# See Also
ElementTransformUtils Members
Autodesk.Revit.DB Namespace